dtbinh/3rdYearsProject/Module6-7/Embeded/lecture/Week5 Material/03_PWM/PIC24_PWM_01.C
/*
*************************** C SOURCE FILE ************************************

project   :
filename  : DEMO_LIB.C
version   : 2
date      :

******************************************************************************

Copyright (c) 20xx
All rights reserved.

******************************************************************************

VERSION HISTORY:
----------------------------
Version      : 1
Date         :
Revised by   :
Description  :

Version      : 2
Date         :
Revised by   :
Description  : *
               *
               *

******************************************************************************
*/

#define PIC24_PWM_01_C_SRC

/****************************************************************************/
/**                                                                        **/
/**                             MODULES USED                               **/
/**                                                                        **/
/****************************************************************************/

#include "PIC24_PWM_01.h"

/****************************************************************************/
/**                                                                        **/
/**                        DEFINITIONS AND MACROS                          **/
/**                                                                        **/
/****************************************************************************/

#define START_DUTY 0

/****************************************************************************/
/**                                                                        **/
/**                        TYPEDEFS AND STRUCTURES                         **/
/**                                                                        **/
/****************************************************************************/


/****************************************************************************/
/**                                                                        **/
/**                      PROTOTYPES OF LOCAL FUNCTIONS                     **/
/**                                                                        **/
/****************************************************************************/

static void HardwareInit(void);

/****************************************************************************/
/**                                                                        **/
/**                           EXPORTED VARIABLES                           **/
/**                                                                        **/
/****************************************************************************/


/****************************************************************************/
/**                                                                        **/
/**                            GLOBAL VARIABLES                            **/
/**                                                                        **/
/****************************************************************************/

static int16u duty1;
/****************************************************************************/
/**                                                                        **/
/**                           EXPORTED FUNCTIONS                           **/
/**                                                                        **/
/****************************************************************************/


/****************************************************************************/
/**                                                                        **/
/**                             LOCAL FUNCTIONS                            **/
/**                                                                        **/
/****************************************************************************/

int main(void)
{
	disable_interrupts(INTR_GLOBAL);
	HardwareInit();
	enable_interrupts(INTR_GLOBAL);
	for(;;)
	{
	}
	return 0;
}

static void HardwareInit(void)
{
	setup_adc_ports(NO_ANALOGS);
	set_tris_a(get_tris_a() & 0xffeb);
	set_tris_b(get_tris_b() & 0xfff3);
	output_high(LED0);
	output_high(LED1);
	output_high(LED2);
	output_high(LED3);

//PWM 1 with Timer 3
	//duty1 = START_DUTY;
	duty1 = 2000;
	set_compare_time(1, duty1, duty1);
	setup_compare(1, COMPARE_PWM | COMPARE_TIMER3);
	
	set_timer3(0);
	setup_timer3(TMR_INTERNAL | TMR_DIV_BY_1, 9999);

// Timer5
	clear_interrupt(INT_TIMER5);
	enable_interrupts(INT_TIMER5);
	set_timer5(0);
	setup_timer5(TMR_INTERNAL | TMR_DIV_BY_256, 6249);
	return;	
}

#INT_TIMER5
void Tmr5ISR(void)
{
	output_toggle(LED3);
	//duty1 = duty1 + 1000;
	if(duty1 > 10000)
	{
		duty1 = 0;
	}
	set_pwm_duty(1, duty1);
	return;
}
/****************************************************************************/

/****************************************************************************/
/**                                                                        **/
/**                                 EOF                                    **/
/**                                                                        **/
/****************************************************************************/